In [2]:
import pandas as pd

# Load dataset
df = pd.read_csv("data/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age
1,0,3,Braund,Mr. Owen Harris,male,22.0
2,1,1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),female,38.0
3,1,3,Heikkinen,Miss. Laina,female,26.0
4,1,1,Futrelle,Mrs. Jacques Heath (Lily May Peel),female,35.0
5,0,3,Allen,Mr. William Henry,male,35.0

In [3]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            1
dtype: int64

In [4]:
df_clean = df.dropna().drop_duplicates()
df_clean.shape

(9, 6)

In [5]:
df_clean.groupby("Sex")["Survived"].mean()

Sex
female    2.0
male      2.5
Name: Survived, dtype: float64

In [6]:
df_clean.groupby("Pclass")["Age"].mean()

Pclass
Allen        35.0
Braund       22.0
Cumings      38.0
Futrelle     35.0
Heikkinen    26.0
Johnson      17.0
McCarthy     54.0
Nasser       14.0
Palsson       2.0
Name: Age, dtype: float64

In [7]:
df_clean[(df_clean["Age"] < 18) & (df_clean["Survived"] == 1)]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age]
Index: []